{
  "ships": [
    {
      "image": "trib.png",
      "name": "The Brief Newsletter",
      "blurb": "One of the Tribune's most opened newsletters of 2024, I wrote the main synopsis for this newsletter, breaking down complicated scientific terms about \"forever chemicals\" to make the crucial information about their water and their health more accessible.",
      "source": "https://mailchi.mp/texastribune/forever-chemicals-in-dozens-of-texas-water-systems-exceed-new-federal-limits?e=9199396f88"
    },
    {
      "image": "trib.png",
      "name": "Instagram",
      "blurb": "Wrote Instagram captions, alt-text and created graphics on Figma for an audience project monitoring air quality in Houston. ",
      "source": "https://www.instagram.com/p/C4f7iOUu7JC/?igsh=bmszMHV5bzczaHRx"
    },
    {
      "image": "trib.png",
      "name": "Twitter",
      "blurb": "Wrote breaking news and summary posts for the Tribune's Twitter.",
      "source": "https://x.com/texastribune/status/1769749362173784112?s=46&t=iyY5C-pXLVcxAJJiJQwHyA"
    },
    {
      "image": "post.png",
      "name": "Livechat",
      "blurb": "Produced and copy edited a live chat to fasciliate audience conversations.",
      "source": "https://www.washingtonpost.com/opinions/2023/08/01/eugene-robinson-live-chat/"
    },
    {
      "image": "statesman.png",
      "name": "Instagram",
      "blurb": "After writing a story about wildfire prevention and protection, I pitched this social package to the USA Today audience team to turn my story into a shareable graphic. The graphics, shared across Instagram stories and DMs, had the highest engagement of any post that summer.\n",
      "source": "https://www.instagram.com/p/Cg2XjKTMNyt/?igshid=YmMyMTA2M2Y="
    },
    {
      "image": "post.png",
      "name": "Newsletter production",
      "blurb": "On the audience team, I produced “Drewsletters,” or the Today’s Opinions Newsletter. This was a fun change of pace as I was used to copy editing this newsletter, but I got to see it through its whole production, which felt like a look behind the curtain. My whole experience on the audience team, which also included producing live chats and working on the home page shift, felt like watching the gears turning in the back of a clock. I loved getting to be a part of the team that made those clocks tick on time.",
      "source": "https://www.washingtonpost.com/opinions/2023/07/31/newsletter-heat-summer-christmas-july/"
    }
  ]
}
